package model

const (
	//主业务类型
	//链路管理类
	J主链路登录请求      = 0x1001
	J主链路登录应答      = 0x1002
	J主链路注销请求      = 0x1003
	J主链路注销应答      = 0x1004
	J主链路连接保持请求    = 0x1005
	J主链路连接保持应答    = 0x1006
	J主链路断开通知      = 0x1007
	J下级平台主动关闭链路通知 = 0x1008
	J从链路连接请求      = 0x9001
	J从链路连接应答      = 0x9002
	J从链路注销请求      = 0x9003

	J从链路注销应答      = 0x9004
	J从链路连接保持请求    = 0x9005
	J从链路连接保持请求应答  = 0x9006
	J从链路断开通知      = 0x9007
	J上级平台主动关闭链路通知 = 0x9008

	//信息统计类
	J接收定位信息数量通知 = 0x9101

	//车辆动态信息交换类
	J主链路动态信息交换 = 0x1200
	J从链路动态信息交换 = 0x9200

	//平台间信息交互类
	J主链路平台信息交换  = 0x1300
	J从链路平台间信息交换 = 0x9300

	//车辆报警信息交互类
	J主链路报警信息交互 = 0x1400
	J从链路报警信息交互 = 0x9400

	//车辆监管类
	J主链路车辆监管 = 0x1500
	J从链路车辆监管 = 0x9500

	//车辆静态信息交换类
	J主链路静态信息交换 = 0x1600
	J从链路静态信息交换 = 0x9600

	//  子业务类型
	//主链路动态交换信息
	J上传车辆注册信息        = 0x1201
	J实时上传车辆定位信息      = 0x1202
	J车辆定位信息自动补报      = 0x1203
	J启动车辆定位信息交换应答    = 0x1205
	J结束车辆定位信息交换应答    = 0x1206
	J申请交换指定车辆定位信息请求  = 0x1207
	J取消交换指定车辆定位信息请求  = 0x1208
	J补发车辆定位信息请求      = 0x1209
	J上报车辆驾驶员身份识别信息应答 = 0x120A
	J上报车辆电子运单应答      = 0x120B
	J主动上报驾驶员身份信息消息   = 0x120C
	J主动上报车辆电子运单信息消息  = 0x120D

	//从链路动态信息交换
	J交换车辆定位信息        = 0x9202
	J车辆定位信息交换补发      = 0x9203
	J交换车辆静态信息        = 0x9204
	J启动车辆定位信息交换请求    = 0x9205
	J结束车辆定位信息交换请求    = 0x9206
	J申请交换指定车辆定位信息应答  = 0x9207
	J取消交换指定车辆定位信息应答  = 0x9208
	J补发车辆定位信息应答      = 0x9209
	J上报车辆驾驶员身份识别信息请求 = 0x920A
	J上报车辆电子运单请求      = 0x920B

	//平台间信息交互
	//主链路
	J平台查岗应答    = 0x1301
	J下发平台间报文应答 = 0x1302
	//从链路
	J平台查岗请求    = 0x9301
	J下发平台间报文请求 = 0x9302

	//主链路报警信息交互
	J报警督办应答       = 0x1401
	J上报报警信息       = 0x1402
	J主动上报报警处理结果信息 = 0x1403
	//从链路报警信息交互
	J报警督办请求   = 0x9401
	J报警预警     = 0x9402
	J实时交换报警信息 = 0x9403

	//主链路车辆监管
	J车辆单向监听应答     = 0x1501
	J车辆拍照应答       = 0x1502
	J下发车辆报文应答     = 0x1503
	J上报车辆行驶记录应答   = 0x1504
	J车辆应急接入督管平台应答 = 0x1505
	J上报车载视频终端安装情况 = 0x150F

	//从链路车辆监管
	J车辆单向监听请求     = 0x9501
	J车辆拍照请求       = 0x9502
	J下发车辆报文请求     = 0x9503
	J上报车辆行驶记录请求   = 0x9504
	J车辆应急接入监管平台请求 = 0x9505

	//主链路静态信息交换
	J补报车辆静态信息应答    = 0x1601
	J补报车辆静态信息应答_福建 = 0x1602
	//从链路静态信息交换
	J补报车辆静态信息请求 = 0x9601

	J公交线路基础信息消息  = 0x1301
	J公交线路GIS信息上传 = 0x1302

	//自定义业务类型
	//主业务类型
	J下发平台业务信息 = 0x9F00
	J命令发送应答   = 0x9F01
	J转发服务通知信息 = 0x9F02
	J链路状态信息   = 0x9F03

	// 下行扩展
	J接收车辆定位信息数量通知消息 = 0x9101
	J定位信息发送数量通知消息   = 0x1101

	J主链路时效口令交互消息 = 0x1700
	J从链路时效口令交互消息 = 0x9700

	J主链路实时音视频交互消息 = 0x1800
	J从链路实时音视频交互消息 = 0x9800

	J主链路远程录像检索交互消息 = 0x1900
	J从链路远程录像检索交互消息 = 0x9900

	J主链路远程录像回放交互消息 = 0x1A00
	J从链路远程录像回放交互消息 = 0x9A00

	J主链路远程录像下载交互消息 = 0x1B00
	J从链路远程录像下载交互消息 = 0x9B00

	J时效口令上报消息 = 0x1701
	J时效口令请求消息 = 0x1702

	J时效口令请求应答消息 = 0x9702

	J实时音视频请求应答消息       = 0x1801
	J主动请求停止实时音视频传输应答消息 = 0x1802

	J实时音视频请求消息       = 0x9801
	J主动请求停止实时音视频传输消息 = 0x9802

	J主动上传音视频资源目录信息消息 = 0x1901
	J查询音视频资源目录应答消息   = 0x1902

	J主动上传音视频资源目录信息应答消息 = 0x9901
	J查询音视频资源目录请求消息     = 0x9902

	J远程录像回放请求消息应答 = 0x1A01
	J远程录像回放控制应答消息 = 0x1A02

	J远程录像下载请求应答消息 = 0x1B01
	J远程录像下载完成通知消息 = 0x1B02
	J远程录像下载控制应答消息 = 0x1B03

	J远程录像下载请求消息     = 0x9B01
	J远程录像下载完成通知应答消息 = 0x9B02
	J远程录像下载控制消息     = 0x9B03

	J远程录像回放请求消息 = 0x9A01
	J远程录像回放控制消息 = 0x9A02

	J下行809透传 = 0x1000
)
